const dataStructureAnalysis = [{
		"tableId": "1",
		"selected": true,
		"tableName": "person",
		"dbName": "joyleader",
		"host": "192.168.3.189",
		"primaryKey": [
			"person_id"
		],
		"comment": "人表",
		"column": [{
				"columnName": "person_id",
				"dataType": "Number",
				"comment": "人id",
				"length": 64,
				"decimalPoint": 0,
				"isNull": true
			},
			{
				"columnName": "name",
				"dataType": "varchar(64)",
				"comment": "name",
				"length": 64,
				"decimalPoint": 0,
				"isNull": false
			}
		]
	},
	{
		"tableId": "2",
		"selected": true,
		"tableName": "animal",
		"dbName": "joyleader",
		"host": "192.168.3.189",
		"primaryKey": [
			"animal_id"
		],
		"comment": "动物表",
		"column": [{
				"columnName": "animal_id",
				"dataType": "Number",
				"comment": "动物id",
				"length": 65,
				"decimalPoint": 0,
				"isNull": true
			},
			{
				"columnName": "name",
				"dataType": "varchar(64)",
				"comment": "name",
				"length": 64,
				"decimalPoint": 0,
				"isNull": false
			},
		]
	},
	{
		"tableId": "3",
		"selected": false,
		"tableName": "plant",
		"dbName": "joyleader",
		"host": "192.168.3.189",
		"primaryKey": [
			"plant_id"
		],
		"comment": "植物表",
		"column": [{
				"columnName": "plant_id",
				"dataType": "Number",
				"comment": "植物id",
				"length": 66,
				"decimalPoint": 0,
				"isNull": false
			},
			{
				"columnName": "name",
				"dataType": "varchar(64)",
				"comment": "name",
				"length": 64,
				"decimalPoint": 0,
				"isNull": true
			},
		]
	}
]

const dataEcharts = [{
		"type": "radar",
		"name": "口碑",
		"indicator": [{
			"text": "正面"
		}, {
			"text": "中立"
		}, {
			"text": "负面"
		}],
		"data": [{
			"name": "催眠大师",
			"value": [1, 0, 0]
		}, {
			"name": "春娇与志明",
			"value": [1, 0, 0]
		}, {
			"name": "无人区",
			"value": [1, 0, 0]
		}, {
			"name": "港囧",
			"value": [1, 0, 0]
		}, {
			"name": "疯狂的石头",
			"value": [0.784874, 0.176464, 0.0386615]
		}, {
			"name": "疯狂的赛车",
			"value": [0.778526, 0.18906, 0.0324138]
		}, {
			"name": "怪兽大学",
			"value": [0.754133, 0.222265, 0.0236015]
		}, {
			"name": "兔侠传奇",
			"value": [0.714542, 0.139318, 0.14614]
		}, {
			"name": "人再囧途之泰囧",
			"value": [0.649086, 0.27863, 0.0722842]
		}, {
			"name": "人在囧途",
			"value": [0.637029, 0.304188, 0.0587828]
		}, {
			"name": "心花路放",
			"value": [0.554995, 0.32587, 0.119135]
		}, {
			"name": "夜·店",
			"value": [0.474609, 0.380166, 0.145225]
		}, {
			"name": "搞定岳父大人",
			"value": [0.460685, 0.416199, 0.123115]
		}, {
			"name": "建党伟业",
			"value": [0.275867, 0.329766, 0.394366]
		}, {
			"name": "一夜惊喜",
			"value": [0.251969, 0.460621, 0.28741]
		}, {
			"name": "大唐玄奘",
			"value": [0.237462, 0.276468, 0.486069]
		}, {
			"name": "摩登年代",
			"value": [0.171469, 0.384383, 0.444148]
		}, {
			"name": "火星没事",
			"value": [0.145427, 0.364715, 0.489858]
		}, {
			"name": "爱情呼叫转移Ⅱ：爱情左右",
			"value": [0.104248, 0.351325, 0.544427]
		}, {
			"name": "嘻游记",
			"value": [0.0416667, 0.124079, 0.834254]
		}],
		"dataName": ["催眠大师", "春娇与志明", "无人区", "港囧", "疯狂的石头", "疯狂的赛车", "怪兽大学", "兔侠传奇", "人再囧途之泰囧", "人在囧途", "心花路放", "夜·店", "搞定岳父大人", "建党伟业", "一夜惊喜", "大唐玄奘", "摩登年代", "火星没事", "爱情呼叫转移Ⅱ：爱情左右", "嘻游记"],
		"chartType": "basicRadar"
	}, {
		"xAxis": ["我不是药神", "疯狂的石头", "无人区", "怪兽大学", "疯狂的赛车", "催眠大师", "人在囧途", "人再囧途之泰囧", "春娇与志明", "心花路放", "超时空同居", "夜·店", "说出你的秘密", "爱情呼叫转移", "搞定岳父大人", "兔侠传奇", "幕后玩家", "一夜惊喜", "港囧", "摩登年代", "第三个人", "大唐玄奘", "爱情呼叫转移Ⅱ：爱情左右", "火星没事", "嘻游记", "江湖儿女", "建党伟业"],
		"xAxisName": "电影名称",
		"yAxisName": "评分",
		"series": {
			"type": "bar",
			"name": "评分",
			"data": [9, 8.2, 8.1, 8, 7.9, 7.6, 7.4, 7.4, 7.4, 7, 6.9, 6.6, 6.5, 6.4, 6.4, 5.8, 5.7, 5.6, 5.6, 5.3, 5.3, 5.2, 5.2, 4.9, 3.3, 0, 0]
		},
		"chartType": "bar"
	}, {
		"type": "pie",
		"name": "电影数量",
		"legendData": ["喜剧", "爱情", "公路", "剧情", "悬疑", "惊悚", "犯罪", "动画", "战争", "怀旧", "西部", "心理", "动作", "奇幻"],
		"seriesData": [{
			"name": "喜剧",
			"value": 16
		}, {
			"name": "爱情",
			"value": 7
		}, {
			"name": "公路",
			"value": 4
		}, {
			"name": "剧情",
			"value": 3
		}, {
			"name": "悬疑",
			"value": 2
		}, {
			"name": "惊悚",
			"value": 2
		}, {
			"name": "犯罪",
			"value": 2
		}, {
			"name": "动画",
			"value": 2
		}, {
			"name": "战争",
			"value": 1
		}, {
			"name": "怀旧",
			"value": 1
		}, {
			"name": "西部",
			"value": 1
		}, {
			"name": "心理",
			"value": 1
		}, {
			"name": "动作",
			"value": 1
		}, {
			"name": "奇幻",
			"value": 1
		}],
		"chartType": "pie"
	}, {
		"type": "pie",
		"name": "电影数量",
		"legendData": ["国庆", "五一", "暑期", "暑期", "清明", "七夕", "暑期", "秋季", "中秋", "五一", "五一", "贺岁"],
		"seriesData": [{
			"name": "国庆",
			"value": 1
		}, {
			"name": "五一",
			"value": 1
		}, {
			"name": "暑期",
			"value": 1
		}, {
			"name": "暑期",
			"value": 1
		}, {
			"name": "清明",
			"value": 1
		}, {
			"name": "七夕",
			"value": 1
		}, {
			"name": "暑期",
			"value": 1
		}, {
			"name": "秋季",
			"value": 1
		}, {
			"name": "中秋",
			"value": 1
		}, {
			"name": "五一",
			"value": 1
		}, {
			"name": "五一",
			"value": 1
		}, {
			"name": "贺岁",
			"value": 1
		}],
		"chartType": "pie"
	},
	/*{
		"xAxis": ["我不是药神", "港囧", "人再囧途之泰囧", "心花路放", "超时空同居", "建党伟业", "幕后玩家", "催眠大师", "无人区", "怪兽大学", "一夜惊喜", "疯狂的赛车", "春娇与志明", "摩登年代", "人在囧途", "爱情呼叫转移Ⅱ：爱情左右", "大唐玄奘", "嘻游记", "疯狂的石头", "搞定岳父大人", "兔侠传奇", "夜·店", "火星没事", "江湖儿女", "说出你的秘密", "爱情呼叫转移", "第三个人"],
		"xAxisName": "电影名称",
		"yAxisName": "票房（万）",
		"series": {
			"type": "bar",
			"name": "票房（万）",
			"data": [309800, 161400, 127000, 117000, 89800, 37200, 35800, 27400, 26000, 21000, 17700, 11001, 7057.1001, 6837.8999, 3751.6001, 3500, 3297.1001, 2890, 2534, 1770.7, 1557.7, 1190, 935, null, null, null, null]
		},
		"chartType": "bar"
	},*/
	{
		"data": [{
			"上映时间": "2018-09-21",
			"电影名称": "江湖儿女"
		}, {
			"上映时间": "2018-07-06",
			"电影名称": "我不是药神"
		}, {
			"上映时间": "2018-05-18",
			"电影名称": "超时空同居"
		}, {
			"上映时间": "2018-04-28",
			"电影名称": "幕后玩家"
		}, {
			"上映时间": "2016-04-29",
			"电影名称": "大唐玄奘"
		}, {
			"上映时间": "2015-09-25",
			"电影名称": "港囧"
		}, {
			"上映时间": "2014-09-30",
			"电影名称": "心花路放"
		}, {
			"上映时间": "2014-04-29",
			"电影名称": "催眠大师"
		}, {
			"上映时间": "2013-12-03",
			"电影名称": "无人区"
		}, {
			"上映时间": "2013-08-23",
			"电影名称": "怪兽大学"
		}, {
			"上映时间": "2013-08-23",
			"电影名称": "摩登年代"
		}, {
			"上映时间": "2013-08-09",
			"电影名称": "一夜惊喜"
		}, {
			"上映时间": "2012-12-12",
			"电影名称": "人再囧途之泰囧"
		}, {
			"上映时间": "2012-08-03",
			"电影名称": "搞定岳父大人"
		}, {
			"上映时间": "2012-03-30",
			"电影名称": "春娇与志明"
		}, {
			"上映时间": "2011-07-11",
			"电影名称": "兔侠传奇"
		}, {
			"上映时间": "2011-06-15",
			"电影名称": "建党伟业"
		}, {
			"上映时间": "2010-07-02",
			"电影名称": "嘻游记"
		}, {
			"上映时间": "2010-06-04",
			"电影名称": "人在囧途"
		}, {
			"上映时间": "2009-11-20",
			"电影名称": "火星没事"
		}, {
			"上映时间": "2009-07-24",
			"电影名称": "夜·店"
		}, {
			"上映时间": "2009-01-20",
			"电影名称": "疯狂的赛车"
		}, {
			"上映时间": "2008-11-26",
			"电影名称": "爱情呼叫转移Ⅱ：爱情左右"
		}, {
			"上映时间": "2006-06-30",
			"电影名称": "疯狂的石头"
		}, {
			"上映时间": null,
			"电影名称": "爱情呼叫转移"
		}, {
			"上映时间": null,
			"电影名称": "第三个人"
		}, {
			"上映时间": null,
			"电影名称": "说出你的秘密"
		}],
		"name": [{
			"pops": "上映时间"
		}, {
			"pops": "电影名称"
		}],
		"chartType": ""
	}, {
		"data": [{
			"上映时间": "2018-09-21",
			"电影名称": "江湖儿女"
		}, {
			"上映时间": "2018-07-06",
			"电影名称": "我不是药神"
		}, {
			"上映时间": "2018-05-18",
			"电影名称": "超时空同居"
		}, {
			"上映时间": "2018-04-28",
			"电影名称": "幕后玩家"
		}, {
			"上映时间": "2016-04-29",
			"电影名称": "大唐玄奘"
		}, {
			"上映时间": "2015-09-25",
			"电影名称": "港囧"
		}, {
			"上映时间": "2014-09-30",
			"电影名称": "心花路放"
		}, {
			"上映时间": "2014-04-29",
			"电影名称": "催眠大师"
		}, {
			"上映时间": "2013-12-03",
			"电影名称": "无人区"
		}, {
			"上映时间": "2013-08-23",
			"电影名称": "怪兽大学"
		}, {
			"上映时间": "2013-08-23",
			"电影名称": "摩登年代"
		}, {
			"上映时间": "2013-08-09",
			"电影名称": "一夜惊喜"
		}, {
			"上映时间": "2012-12-12",
			"电影名称": "人再囧途之泰囧"
		}, {
			"上映时间": "2012-08-03",
			"电影名称": "搞定岳父大人"
		}, {
			"上映时间": "2012-03-30",
			"电影名称": "春娇与志明"
		}, {
			"上映时间": "2011-07-11",
			"电影名称": "兔侠传奇"
		}, {
			"上映时间": "2011-06-15",
			"电影名称": "建党伟业"
		}, {
			"上映时间": "2010-07-02",
			"电影名称": "嘻游记"
		}, {
			"上映时间": "2010-06-04",
			"电影名称": "人在囧途"
		}, {
			"上映时间": "2009-11-20",
			"电影名称": "火星没事"
		}, {
			"上映时间": "2009-07-24",
			"电影名称": "夜·店"
		}, {
			"上映时间": "2009-01-20",
			"电影名称": "疯狂的赛车"
		}, {
			"上映时间": "2008-11-26",
			"电影名称": "爱情呼叫转移Ⅱ：爱情左右"
		}, {
			"上映时间": "2006-06-30",
			"电影名称": "疯狂的石头"
		}, {
			"上映时间": null,
			"电影名称": "爱情呼叫转移"
		}, {
			"上映时间": null,
			"电影名称": "第三个人"
		}, {
			"上映时间": null,
			"电影名称": "说出你的秘密"
		}],
		"name": [{
			"pops": "上映时间"
		}, {
			"pops": "电影名称"
		}],
		"chartType": ""
	}
]

export {
	dataStructureAnalysis,
	dataEcharts,
}